# FaceSecondDerivatives Class

---
Contains second partial derivatives of a face at a specified point.
SystemObject Autodesk.Revit.DBFaceSecondDerivatives
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FaceSecondDerivatives : IDisposable

    Public Class FaceSecondDerivatives
    	Implements IDisposable

    public ref class FaceSecondDerivatives : IDisposable

    type FaceSecondDerivatives =
        class
            interface IDisposable
        end
The FaceSecondDerivatives type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MixedDerivative|  The mixed derivative.
| UUDerivative|  The second derivative with respect to U.
| VVDerivative|  The second derivative with respect to V.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the FaceSecondDerivatives
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace